---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ElementsConnectedToParent
source: html/27eec8fa-77bc-8ac0-b011-5a110ef83804.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ElementsConnectedToParent Property

You have selected elements that are connected to a parent object in a System. These elements cannot be removed from the System.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementsConnectedToParent { get; }
```